1. Add an expense: 
 Create a function to prompt the user for expense details. Ensure you ask for
 o The date of the expense in the format YYYY-MM-DD
o The category of the expense, such as Food or Trave
o The amount spe 
o A brief description of the ex
ee 
â€¢ Store the expense in a list as a dictionary, where each dictionary includes the 
date, category, amount, and description as key-value pairs 
Example: 
{'date': '2024-09-18', 'category': 'Food', 'amount': 15.50, 'description': 
'Lunch with friends'}

In [37]:
import pandas as pd
expenses_trak = pd.DataFrame(columns=['date', 'category', 'amount', 'description'])

In [38]:
def add_expense(new_expense):
    idx=len(expenses_trak) -1
    expenses_trak.loc[idx] = new_expense
    return expenses_trak

In [39]:
new_expense = {'date': '2024-09-20', 'category': 'Cinema', 'amount': 7.65, 'description': 'Cinema with sister'}

In [40]:
add_expense(new_expense)

          date category  amount         description
-1  2024-09-20   Cinema    7.65  Cinema with sister

In [41]:
new_expense = {'date': '2024-09-18', 'category': 'Food', 'amount': 100, 'description': 'Dinner with family'}

In [42]:
add_expense(new_expense)

          date category  amount         description
-1  2024-09-20   Cinema    7.65  Cinema with sister
 0  2024-09-18     Food  100.00  Dinner with family

In [43]:
new_expense = {'date': '2024-09-19', 'category': 'Health', 'amount': 30.50, 'description': 'Manicure'}

In [44]:
add_expense(new_expense)

          date category  amount         description
-1  2024-09-20   Cinema    7.65  Cinema with sister
 0  2024-09-18     Food  100.00  Dinner with family
 1  2024-09-19   Health   30.50            Manicure

In [74]:
import datetime

def input_expense():
    new_expense = {}
    try:
        new_expense['date'] = datetime.date.fromisoformat(input("Please indicate the date of you expense in format 'YYYY-MM-DD'"))
    except:
        print("Please insert the date in the following format 'YYYY-MM-DD'")
        raise ValueError("Incorrect data format, should be YYYY-MM-DD")
 
    new_expense['category'] = input("Please indicate the category of the expense'")
    new_expense['description'] = input("Please provide a short description of the expense'")
    
    try :
        new_expense['amount'] = float(str(input("Please indicate the amount of your expense")).replace(",", "."))
    except Exception as e:
        print("Please insert the correct amount")
        raise ValueError("Incorrect amount format")
    return new_expense

In [75]:
new_expense = input_expense()

Please indicate the date of you expense in format 'YYYY-MM-DD' 2024-11-15
Please indicate the category of the expense' Transports
Please provide a short description of the expense' Taxi to the airport
Please indicate the amount of your expense 36,89

In [76]:
new_expense

{'date': datetime.date(2024, 11, 15),
 'category': 'Transports',
 'description': 'Taxi to the airport',
 'amount': 36.89}

In [77]:
add_expense(new_expense)

          date    category  amount          description
-1  2024-09-20      Cinema    7.65   Cinema with sister
 0  2024-09-18        Food  100.00   Dinner with family
 1  2024-09-19      Health   30.50             Manicure
 2  2024-09-19      Health   23.90             Manicure
 3  2024-09-19      Health   23.90             Manicure
 4  2024-11-15  Transports   36.89  Taxi to the airport

In [81]:
new_expense = {'date': '2024-09-19',
 'category': np.nan,
 'amount': 23.9,
 'description': 'Manicure'}

In [82]:
add_expense(new_expense)

          date    category  amount          description
-1  2024-09-20      Cinema    7.65   Cinema with sister
 0  2024-09-18        Food  100.00   Dinner with family
 1  2024-09-19      Health   30.50             Manicure
 2  2024-09-19      Health   23.90             Manicure
 3  2024-09-19      Health   23.90             Manicure
 4  2024-11-15  Transports   36.89  Taxi to the airport
 5  2024-09-19         NaN   23.90             Manicure

In [104]:
import numpy as np

def visualize_expenses():
    if np.where(pd.isnull(expenses_trak)):
        print("Some entries are incomplete and have been hidden")
    print(expenses_trak.dropna(axis=0).to_string(index=False))

In [105]:
visualize_expenses()

Some entries are incomplete and have been hidden
      date   category  amount         description
2024-09-20     Cinema    7.65  Cinema with sister
2024-09-18       Food  100.00  Dinner with family
2024-09-19     Health   30.50            Manicure
2024-09-19     Health   23.90            Manicure
2024-09-19     Health   23.90            Manicure
2024-11-15 Transports   36.89 Taxi to the airport

In [106]:
expenses_trak

          date    category  amount          description
-1  2024-09-20      Cinema    7.65   Cinema with sister
 0  2024-09-18        Food  100.00   Dinner with family
 1  2024-09-19      Health   30.50             Manicure
 2  2024-09-19      Health   23.90             Manicure
 3  2024-09-19      Health   23.90             Manicure
 4  2024-11-15  Transports   36.89  Taxi to the airport
 5  2024-09-19         NaN   23.90             Manicure